{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "about",
    "1": "acceptance",
    "2": "accepting_flaws",
    "3": "accepting_help",
    "4": "adoration",
    "5": "afternoon",
    "6": "agitation",
    "7": "alienation",
    "8": "amazement",
    "9": "ambivalence",
    "10": "amusement",
    "11": "anger",
    "12": "anger_management",
    "13": "anguish",
    "14": "annoyance",
    "15": "anticipation",
    "16": "anxiety",
    "17": "anxiety_management",
    "18": "anxiety_triggers",
    "19": "anxious",
    "20": "apathy",
    "21": "appreciation",
    "22": "arousal",
    "23": "ask",
    "24": "betrayal",
    "25": "bitterness",
    "26": "bliss",
    "27": "boredom",
    "28": "boundary_setting",
    "29": "breaking_bad_habits",
    "30": "breaking_the_cycle",
    "31": "building_courage",
    "32": "building_resilience",
    "33": "building_self_worth",
    "34": "calm_heart",
    "35": "calm_mind",
    "36": "calmness",
    "37": "casual",
    "38": "changing_perspectives",
    "39": "checking_in",
    "40": "chronic_stress",
    "41": "comforting_words",
    "42": "confidence",
    "43": "confidence_boosting",
    "44": "confusion",
    "45": "coping",
    "46": "coping_mechanisms",
    "47": "coping_with_anger",
    "48": "coping_with_change",
    "49": "courage",
    "50": "creating",
    "51": "creation",
    "52": "curiosity",
    "53": "dealing_with_doubts",
    "54": "dealing_with_failure",
    "55": "dealing_with_regret",
    "56": "death",
    "57": "default",
    "58": "defeat",
    "59": "delight",
    "60": "depressed",
    "61": "depression",
    "62": "depression_management",
    "63": "despair",
    "64": "desperation",
    "65": "determination",
    "66": "devastation",
    "67": "disappointment",
    "68": "discomfort",
    "69": "disgust",
    "70": "dismay",
    "71": "distraction_techniques",
    "72": "done",
    "73": "doubts_and_fears",
    "74": "dread",
    "75": "eagerness",
    "76": "elation",
    "77": "embracing_change",
    "78": "emotional_balance",
    "79": "emotional_boundaries",
    "80": "emotional_regulation",
    "81": "emotional_support",
    "82": "empathy",
    "83": "encouragement",
    "84": "envy",
    "85": "euphoria",
    "86": "evening",
    "87": "excitement",
    "88": "exercise_for_mood",
    "89": "exhaustion",
    "90": "fact-1",
    "91": "fact-10",
    "92": "fact-100",
    "93": "fact-101",
    "94": "fact-102",
    "95": "fact-103",
    "96": "fact-104",
    "97": "fact-105",
    "98": "fact-106",
    "99": "fact-107",
    "100": "fact-108",
    "101": "fact-109",
    "102": "fact-11",
    "103": "fact-110",
    "104": "fact-111",
    "105": "fact-112",
    "106": "fact-113",
    "107": "fact-114",
    "108": "fact-115",
    "109": "fact-116",
    "110": "fact-117",
    "111": "fact-118",
    "112": "fact-119",
    "113": "fact-12",
    "114": "fact-120",
    "115": "fact-121",
    "116": "fact-122",
    "117": "fact-123",
    "118": "fact-124",
    "119": "fact-125",
    "120": "fact-126",
    "121": "fact-127",
    "122": "fact-128",
    "123": "fact-129",
    "124": "fact-13",
    "125": "fact-130",
    "126": "fact-131",
    "127": "fact-132",
    "128": "fact-133",
    "129": "fact-134",
    "130": "fact-135",
    "131": "fact-136",
    "132": "fact-137",
    "133": "fact-138",
    "134": "fact-139",
    "135": "fact-14",
    "136": "fact-140",
    "137": "fact-141",
    "138": "fact-142",
    "139": "fact-143",
    "140": "fact-144",
    "141": "fact-145",
    "142": "fact-146",
    "143": "fact-15",
    "144": "fact-16",
    "145": "fact-17",
    "146": "fact-18",
    "147": "fact-19",
    "148": "fact-2",
    "149": "fact-20",
    "150": "fact-21",
    "151": "fact-22",
    "152": "fact-23",
    "153": "fact-24",
    "154": "fact-25",
    "155": "fact-26",
    "156": "fact-27",
    "157": "fact-28",
    "158": "fact-29",
    "159": "fact-3",
    "160": "fact-30",
    "161": "fact-31",
    "162": "fact-32",
    "163": "fact-33",
    "164": "fact-34",
    "165": "fact-35",
    "166": "fact-36",
    "167": "fact-37",
    "168": "fact-38",
    "169": "fact-39",
    "170": "fact-40",
    "171": "fact-41",
    "172": "fact-42",
    "173": "fact-43",
    "174": "fact-44",
    "175": "fact-45",
    "176": "fact-46",
    "177": "fact-47",
    "178": "fact-48",
    "179": "fact-49",
    "180": "fact-5",
    "181": "fact-50",
    "182": "fact-51",
    "183": "fact-52",
    "184": "fact-53",
    "185": "fact-54",
    "186": "fact-55",
    "187": "fact-56",
    "188": "fact-57",
    "189": "fact-58",
    "190": "fact-59",
    "191": "fact-6",
    "192": "fact-60",
    "193": "fact-61",
    "194": "fact-62",
    "195": "fact-63",
    "196": "fact-64",
    "197": "fact-65",
    "198": "fact-66",
    "199": "fact-67",
    "200": "fact-68",
    "201": "fact-69",
    "202": "fact-7",
    "203": "fact-70",
    "204": "fact-71",
    "205": "fact-72",
    "206": "fact-73",
    "207": "fact-74",
    "208": "fact-75",
    "209": "fact-76",
    "210": "fact-77",
    "211": "fact-78",
    "212": "fact-79",
    "213": "fact-8",
    "214": "fact-80",
    "215": "fact-81",
    "216": "fact-82",
    "217": "fact-83",
    "218": "fact-84",
    "219": "fact-85",
    "220": "fact-86",
    "221": "fact-87",
    "222": "fact-88",
    "223": "fact-89",
    "224": "fact-9",
    "225": "fact-90",
    "226": "fact-91",
    "227": "fact-92",
    "228": "fact-93",
    "229": "fact-94",
    "230": "fact-95",
    "231": "fact-96",
    "232": "fact-97",
    "233": "fact-98",
    "234": "fact-99",
    "235": "fear",
    "236": "feeling_better",
    "237": "feeling_burned_out",
    "238": "feeling_connected",
    "239": "feeling_exhausted",
    "240": "feeling_helpless",
    "241": "feeling_hopeless",
    "242": "feeling_rejected",
    "243": "feeling_strong",
    "244": "feeling_unworthy",
    "245": "feeling_weak",
    "246": "finding_inner_peace",
    "247": "finding_purpose",
    "248": "forgiveness",
    "249": "forgiving_oneself",
    "250": "friends",
    "251": "frustration",
    "252": "goal_setting",
    "253": "goodbye",
    "254": "gratitude",
    "255": "gratitude_practice",
    "256": "greeting",
    "257": "grief",
    "258": "guided_meditation",
    "259": "guilt",
    "260": "happy",
    "261": "hate-me",
    "262": "hate-you",
    "263": "healing",
    "264": "healing_wounds",
    "265": "help",
    "266": "help_seeking",
    "267": "hope",
    "268": "hope_for_the_future",
    "269": "hope_in_the_dark",
    "270": "hopelessness",
    "271": "improving_mental_health",
    "272": "inner_peace",
    "273": "inner_strength",
    "274": "insecurity",
    "275": "irritation",
    "276": "jokes",
    "277": "joy",
    "278": "learn-mental-health",
    "279": "learn-more",
    "280": "learning_from_mistakes",
    "281": "letting_go",
    "282": "letting_go_of_anger",
    "283": "letting_others_in",
    "284": "life_motivation",
    "285": "lifestyle_changes",
    "286": "listening",
    "287": "location",
    "288": "loneliness",
    "289": "loss",
    "290": "love",
    "291": "meditation",
    "292": "mental-health-fact",
    "293": "mental_clarity",
    "294": "mental_fatigue",
    "295": "mental_health_checkin",
    "296": "mental_health_day",
    "297": "mental_health_resources",
    "298": "mental_health_stigma",
    "299": "mind_over_matter",
    "300": "mindful_eating",
    "301": "mindfulness",
    "302": "morning",
    "303": "motivation",
    "304": "name",
    "305": "neutral-response",
    "306": "night",
    "307": "no-approach",
    "308": "no-response",
    "309": "nostalgia",
    "310": "not-talking",
    "311": "overcoming_fear",
    "312": "overcoming_obstacles",
    "313": "overwhelmed",
    "314": "pandora-useful",
    "315": "panic",
    "316": "personal_boundaries",
    "317": "personal_growth",
    "318": "positive_affirmation",
    "319": "pride",
    "320": "problem",
    "321": "procrastination",
    "322": "productivity",
    "323": "progress_not_perfection",
    "324": "reassurance",
    "325": "recovery_process",
    "326": "regret",
    "327": "relationship_advice",
    "328": "relaxation_techniques",
    "329": "relief",
    "330": "repeat",
    "331": "resentment",
    "332": "resilience_building",
    "333": "sad",
    "334": "satisfaction",
    "335": "scared",
    "336": "self-esteem",
    "337": "self_acceptance",
    "338": "self_awareness",
    "339": "self_care",
    "340": "self_compassion",
    "341": "self_doubt",
    "342": "self_esteem",
    "343": "self_improvement",
    "344": "self_love",
    "345": "self_reflection",
    "346": "self_trust",
    "347": "shame",
    "348": "skill",
    "349": "sleep",
    "350": "social_isolation",
    "351": "something-else",
    "352": "stress_management",
    "353": "stress_relief",
    "354": "stressed",
    "355": "struggling_with_life",
    "356": "stupid",
    "357": "suicide",
    "358": "surprise",
    "359": "talking_about_emotions",
    "360": "talking_about_feelings",
    "361": "talking_about_stress",
    "362": "talking_about_the_past",
    "363": "thanks",
    "364": "therapy_techniques",
    "365": "thought_reframing",
    "366": "time_management",
    "367": "trauma",
    "368": "trust",
    "369": "trust_issues",
    "370": "understand",
    "371": "user-advice",
    "372": "user-agree",
    "373": "user-meditation",
    "374": "who are you",
    "375": "worthless",
    "376": "wrong"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "about": 0,
    "acceptance": 1,
    "accepting_flaws": 2,
    "accepting_help": 3,
    "adoration": 4,
    "afternoon": 5,
    "agitation": 6,
    "alienation": 7,
    "amazement": 8,
    "ambivalence": 9,
    "amusement": 10,
    "anger": 11,
    "anger_management": 12,
    "anguish": 13,
    "annoyance": 14,
    "anticipation": 15,
    "anxiety": 16,
    "anxiety_management": 17,
    "anxiety_triggers": 18,
    "anxious": 19,
    "apathy": 20,
    "appreciation": 21,
    "arousal": 22,
    "ask": 23,
    "betrayal": 24,
    "bitterness": 25,
    "bliss": 26,
    "boredom": 27,
    "boundary_setting": 28,
    "breaking_bad_habits": 29,
    "breaking_the_cycle": 30,
    "building_courage": 31,
    "building_resilience": 32,
    "building_self_worth": 33,
    "calm_heart": 34,
    "calm_mind": 35,
    "calmness": 36,
    "casual": 37,
    "changing_perspectives": 38,
    "checking_in": 39,
    "chronic_stress": 40,
    "comforting_words": 41,
    "confidence": 42,
    "confidence_boosting": 43,
    "confusion": 44,
    "coping": 45,
    "coping_mechanisms": 46,
    "coping_with_anger": 47,
    "coping_with_change": 48,
    "courage": 49,
    "creating": 50,
    "creation": 51,
    "curiosity": 52,
    "dealing_with_doubts": 53,
    "dealing_with_failure": 54,
    "dealing_with_regret": 55,
    "death": 56,
    "default": 57,
    "defeat": 58,
    "delight": 59,
    "depressed": 60,
    "depression": 61,
    "depression_management": 62,
    "despair": 63,
    "desperation": 64,
    "determination": 65,
    "devastation": 66,
    "disappointment": 67,
    "discomfort": 68,
    "disgust": 69,
    "dismay": 70,
    "distraction_techniques": 71,
    "done": 72,
    "doubts_and_fears": 73,
    "dread": 74,
    "eagerness": 75,
    "elation": 76,
    "embracing_change": 77,
    "emotional_balance": 78,
    "emotional_boundaries": 79,
    "emotional_regulation": 80,
    "emotional_support": 81,
    "empathy": 82,
    "encouragement": 83,
    "envy": 84,
    "euphoria": 85,
    "evening": 86,
    "excitement": 87,
    "exercise_for_mood": 88,
    "exhaustion": 89,
    "fact-1": 90,
    "fact-10": 91,
    "fact-100": 92,
    "fact-101": 93,
    "fact-102": 94,
    "fact-103": 95,
    "fact-104": 96,
    "fact-105": 97,
    "fact-106": 98,
    "fact-107": 99,
    "fact-108": 100,
    "fact-109": 101,
    "fact-11": 102,
    "fact-110": 103,
    "fact-111": 104,
    "fact-112": 105,
    "fact-113": 106,
    "fact-114": 107,
    "fact-115": 108,
    "fact-116": 109,
    "fact-117": 110,
    "fact-118": 111,
    "fact-119": 112,
    "fact-12": 113,
    "fact-120": 114,
    "fact-121": 115,
    "fact-122": 116,
    "fact-123": 117,
    "fact-124": 118,
    "fact-125": 119,
    "fact-126": 120,
    "fact-127": 121,
    "fact-128": 122,
    "fact-129": 123,
    "fact-13": 124,
    "fact-130": 125,
    "fact-131": 126,
    "fact-132": 127,
    "fact-133": 128,
    "fact-134": 129,
    "fact-135": 130,
    "fact-136": 131,
    "fact-137": 132,
    "fact-138": 133,
    "fact-139": 134,
    "fact-14": 135,
    "fact-140": 136,
    "fact-141": 137,
    "fact-142": 138,
    "fact-143": 139,
    "fact-144": 140,
    "fact-145": 141,
    "fact-146": 142,
    "fact-15": 143,
    "fact-16": 144,
    "fact-17": 145,
    "fact-18": 146,
    "fact-19": 147,
    "fact-2": 148,
    "fact-20": 149,
    "fact-21": 150,
    "fact-22": 151,
    "fact-23": 152,
    "fact-24": 153,
    "fact-25": 154,
    "fact-26": 155,
    "fact-27": 156,
    "fact-28": 157,
    "fact-29": 158,
    "fact-3": 159,
    "fact-30": 160,
    "fact-31": 161,
    "fact-32": 162,
    "fact-33": 163,
    "fact-34": 164,
    "fact-35": 165,
    "fact-36": 166,
    "fact-37": 167,
    "fact-38": 168,
    "fact-39": 169,
    "fact-40": 170,
    "fact-41": 171,
    "fact-42": 172,
    "fact-43": 173,
    "fact-44": 174,
    "fact-45": 175,
    "fact-46": 176,
    "fact-47": 177,
    "fact-48": 178,
    "fact-49": 179,
    "fact-5": 180,
    "fact-50": 181,
    "fact-51": 182,
    "fact-52": 183,
    "fact-53": 184,
    "fact-54": 185,
    "fact-55": 186,
    "fact-56": 187,
    "fact-57": 188,
    "fact-58": 189,
    "fact-59": 190,
    "fact-6": 191,
    "fact-60": 192,
    "fact-61": 193,
    "fact-62": 194,
    "fact-63": 195,
    "fact-64": 196,
    "fact-65": 197,
    "fact-66": 198,
    "fact-67": 199,
    "fact-68": 200,
    "fact-69": 201,
    "fact-7": 202,
    "fact-70": 203,
    "fact-71": 204,
    "fact-72": 205,
    "fact-73": 206,
    "fact-74": 207,
    "fact-75": 208,
    "fact-76": 209,
    "fact-77": 210,
    "fact-78": 211,
    "fact-79": 212,
    "fact-8": 213,
    "fact-80": 214,
    "fact-81": 215,
    "fact-82": 216,
    "fact-83": 217,
    "fact-84": 218,
    "fact-85": 219,
    "fact-86": 220,
    "fact-87": 221,
    "fact-88": 222,
    "fact-89": 223,
    "fact-9": 224,
    "fact-90": 225,
    "fact-91": 226,
    "fact-92": 227,
    "fact-93": 228,
    "fact-94": 229,
    "fact-95": 230,
    "fact-96": 231,
    "fact-97": 232,
    "fact-98": 233,
    "fact-99": 234,
    "fear": 235,
    "feeling_better": 236,
    "feeling_burned_out": 237,
    "feeling_connected": 238,
    "feeling_exhausted": 239,
    "feeling_helpless": 240,
    "feeling_hopeless": 241,
    "feeling_rejected": 242,
    "feeling_strong": 243,
    "feeling_unworthy": 244,
    "feeling_weak": 245,
    "finding_inner_peace": 246,
    "finding_purpose": 247,
    "forgiveness": 248,
    "forgiving_oneself": 249,
    "friends": 250,
    "frustration": 251,
    "goal_setting": 252,
    "goodbye": 253,
    "gratitude": 254,
    "gratitude_practice": 255,
    "greeting": 256,
    "grief": 257,
    "guided_meditation": 258,
    "guilt": 259,
    "happy": 260,
    "hate-me": 261,
    "hate-you": 262,
    "healing": 263,
    "healing_wounds": 264,
    "help": 265,
    "help_seeking": 266,
    "hope": 267,
    "hope_for_the_future": 268,
    "hope_in_the_dark": 269,
    "hopelessness": 270,
    "improving_mental_health": 271,
    "inner_peace": 272,
    "inner_strength": 273,
    "insecurity": 274,
    "irritation": 275,
    "jokes": 276,
    "joy": 277,
    "learn-mental-health": 278,
    "learn-more": 279,
    "learning_from_mistakes": 280,
    "letting_go": 281,
    "letting_go_of_anger": 282,
    "letting_others_in": 283,
    "life_motivation": 284,
    "lifestyle_changes": 285,
    "listening": 286,
    "location": 287,
    "loneliness": 288,
    "loss": 289,
    "love": 290,
    "meditation": 291,
    "mental-health-fact": 292,
    "mental_clarity": 293,
    "mental_fatigue": 294,
    "mental_health_checkin": 295,
    "mental_health_day": 296,
    "mental_health_resources": 297,
    "mental_health_stigma": 298,
    "mind_over_matter": 299,
    "mindful_eating": 300,
    "mindfulness": 301,
    "morning": 302,
    "motivation": 303,
    "name": 304,
    "neutral-response": 305,
    "night": 306,
    "no-approach": 307,
    "no-response": 308,
    "nostalgia": 309,
    "not-talking": 310,
    "overcoming_fear": 311,
    "overcoming_obstacles": 312,
    "overwhelmed": 313,
    "pandora-useful": 314,
    "panic": 315,
    "personal_boundaries": 316,
    "personal_growth": 317,
    "positive_affirmation": 318,
    "pride": 319,
    "problem": 320,
    "procrastination": 321,
    "productivity": 322,
    "progress_not_perfection": 323,
    "reassurance": 324,
    "recovery_process": 325,
    "regret": 326,
    "relationship_advice": 327,
    "relaxation_techniques": 328,
    "relief": 329,
    "repeat": 330,
    "resentment": 331,
    "resilience_building": 332,
    "sad": 333,
    "satisfaction": 334,
    "scared": 335,
    "self-esteem": 336,
    "self_acceptance": 337,
    "self_awareness": 338,
    "self_care": 339,
    "self_compassion": 340,
    "self_doubt": 341,
    "self_esteem": 342,
    "self_improvement": 343,
    "self_love": 344,
    "self_reflection": 345,
    "self_trust": 346,
    "shame": 347,
    "skill": 348,
    "sleep": 349,
    "social_isolation": 350,
    "something-else": 351,
    "stress_management": 352,
    "stress_relief": 353,
    "stressed": 354,
    "struggling_with_life": 355,
    "stupid": 356,
    "suicide": 357,
    "surprise": 358,
    "talking_about_emotions": 359,
    "talking_about_feelings": 360,
    "talking_about_stress": 361,
    "talking_about_the_past": 362,
    "thanks": 363,
    "therapy_techniques": 364,
    "thought_reframing": 365,
    "time_management": 366,
    "trauma": 367,
    "trust": 368,
    "trust_issues": 369,
    "understand": 370,
    "user-advice": 371,
    "user-agree": 372,
    "user-meditation": 373,
    "who are you": 374,
    "worthless": 375,
    "wrong": 376
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
